; domain
(define (domain tankyard)
    (:requirements :strips :typing :equality :adl :fluents)
    (:types tank)
  (:predicates
    (idle ?x - tank)
  )

    (:functions
        (level ?c - tank);; - int  ;; The value shown in counter ?c
        (flowrate ?c - tank);;
        (capacity);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action fill
         :parameters (?c - tank)
         :precondition (and (<= (+ (level ?c) (flowrate ?c)) (capacity)))
         :effect (and (increase (level ?c) (flowrate ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action drain
         :parameters (?c - tank)
         :precondition (and (>= (- (level ?c) (flowrate ?c)) 0))
         :effect (and (decrease (level ?c) (flowrate ?c)))
    )

    (:action open_valve
         :parameters (?c - tank)
         :precondition (and (<= (+ (flowrate ?c) 1) 10))
         :effect (and (increase (flowrate ?c) 1))
    )

    (:action close_valve
         :parameters (?c - tank)
         :precondition (and (>= (flowrate ?c) 1))
         :effect (and (decrease (flowrate ?c) 1))
    )
)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_3_100)
	(:domain tankyard)
	(:objects
		tank0 tank1 tank2 - tank
	)
  (:init
		(= (level tank0) 14)
	(= (level tank1) 8)
	(= (level tank2) 82)

        (= (flowrate tank0) 0)
	(= (flowrate tank1) 0)
	(= (flowrate tank2) 0)

		(= (capacity) 100)
	)
	(:goal
		(and
			(<= (+ (level tank0) 1) (level tank1))
	(<= (+ (level tank1) 1) (level tank2))
		)
	)
)

; plan
1. (open_valve tank1)
   changed: (flowrate tank1) from 0 to 1
   goals met: 1 of 2
2. (fill tank1)
   changed: (level tank1) from 8 to 9
   goals met: 1 of 2
3. (fill tank1)
   changed: (level tank1) from 9 to 10
   goals met: 1 of 2
4. (fill tank1)
   changed: (level tank1) from 10 to 11
   goals met: 1 of 2
5. (fill tank1)
   changed: (level tank1) from 11 to 12
   goals met: 1 of 2
6. (fill tank1)
   changed: (level tank1) from 12 to 13
   goals met: 1 of 2
7. (fill tank1)
   changed: (level tank1) from 13 to 14
   goals met: 1 of 2
8. (fill tank1)
   changed: (level tank1) from 14 to 15
   goals met: 2 of 2
